# new rows and NaN

- NaN = Not a Number

In [76]:
import numpy as np
import pandas as pd

students =  {"Corey": [63,75,88], "Kevin": [48,98,92], "Akshay": [87,86,85]}

#transform into pandas DataFrame

df = pd.DataFrame(students)

#change columns and rows
df=df.T
df

#change the colum names 
df.columns = ["Quiz1", "Quiz2","Quiz3"]
df

        Quiz1  Quiz2  Quiz3
Corey      63     75     88
Kevin      48     98     92
Akshay     87     86     85

In [77]:
#add new column (well done)
df ["Quiz4"] = [40,45,85]
df

        Quiz1  Quiz2  Quiz3  Quiz4
Corey      63     75     88     40
Kevin      48     98     92     45
Akshay     87     86     85     85

## my solution

In [78]:
#add new row (adrian )
df_polished= df.T


df_polished

       Corey  Kevin  Akshay
Quiz1     63     48      87
Quiz2     75     98      86
Quiz3     88     92      85
Quiz4     40     45      85

In [79]:
df_polished ["Adrian"] = [np.NaN,np.NaN,np.NaN,71]
df_polished

       Corey  Kevin  Akshay  Adrian
Quiz1     63     48      87     NaN
Quiz2     75     98      86     NaN
Quiz3     88     92      85     NaN
Quiz4     40     45      85    71.0

In [80]:
df_polished = df_polished.T
df_polished

        Quiz1  Quiz2  Quiz3  Quiz4
Corey    63.0   75.0   88.0   40.0
Kevin    48.0   98.0   92.0   45.0
Akshay   87.0   86.0   85.0   85.0
Adrian    NaN    NaN    NaN   71.0

## solution from course

In [93]:
#solution without turning the DataFrame (called db_polished)
#you create a new DataFram e
import numpy as np
df_new = pd.DataFrame ({"Quiz1":[np.NaN],"Quiz2":[np.NaN],"Quiz3":[np.NaN],"Quiz4":[71]}, index = ["Adrian"])
df_new

        Quiz1  Quiz2  Quiz3  Quiz4
Adrian    NaN    NaN    NaN     71

In [94]:
#concatenate both DataFrames 


together =[df,df_new]



concatenated_df = pd.concat(together)
concatenated_df


#or instead of together: list with all DataFrames

        Quiz1  Quiz2  Quiz3  Quiz4
Corey    63.0   75.0   88.0     40
Kevin    48.0   98.0   92.0     45
Akshay   87.0   86.0   85.0     85
Adrian    NaN    NaN    NaN     71

In [95]:
#create the mean while ignoring the NaNs

concatenated_df ["Quiz_Average"] =concatenated_df.mean(axis=1)
concatenated_df

        Quiz1  Quiz2  Quiz3  Quiz4  Quiz_Average
Corey    63.0   75.0   88.0     40         66.50
Kevin    48.0   98.0   92.0     45         70.75
Akshay   87.0   86.0   85.0     85         85.75
Adrian    NaN    NaN    NaN     71         71.00

In [97]:
#cast column types 
concatenated_df.Quiz4.astype(float)

Corey     40.0
Kevin     45.0
Akshay    85.0
Adrian    71.0
Name: Quiz4, dtype: float64

In [98]:
concatenated_df

        Quiz1  Quiz2  Quiz3  Quiz4  Quiz_Average
Corey    63.0   75.0   88.0     40         66.50
Kevin    48.0   98.0   92.0     45         70.75
Akshay   87.0   86.0   85.0     85         85.75
Adrian    NaN    NaN    NaN     71         71.00